espressif/esp-idf/components/soc/esp32c5/register/soc/sdio_slc_reg.h
/** SDIO_SLC_SLC1INT_ENA_REG register
 *  Sdio slave DMA channel1 interrupt enable register.
 */
#define SDIO_SLC_SLC1INT_ENA_REG (DR_REG_SDIO_BASE + 0x1c)
/** SDIO_SLC_FRHOST_BIT8_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enable bit for SLC_FRHOST_BIT0_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT8_INT_ENA    (BIT(0))
#define SDIO_SLC_FRHOST_BIT8_INT_ENA_M  (SDIO_SLC_FRHOST_BIT8_INT_ENA_V << SDIO_SLC_FRHOST_BIT8_INT_ENA_S)
#define SDIO_SLC_FRHOST_BIT8_INT_ENA_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT8_INT_ENA_S  0
/** SDIO_SLC_FRHOST_BIT9_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enable bit for SLC_FRHOST_BIT1_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT9_INT_ENA    (BIT(1))
#define SDIO_SLC_FRHOST_BIT9_INT_ENA_M  (SDIO_SLC_FRHOST_BIT9_INT_ENA_V << SDIO_SLC_FRHOST_BIT9_INT_ENA_S)
#define SDIO_SLC_FRHOST_BIT9_INT_ENA_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT9_INT_ENA_S  1
/** SDIO_SLC_FRHOST_BIT10_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enable bit for SLC_FRHOST_BIT2_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT10_INT_ENA    (BIT(2))
#define SDIO_SLC_FRHOST_BIT10_INT_ENA_M  (SDIO_SLC_FRHOST_BIT10_INT_ENA_V << SDIO_SLC_FRHOST_BIT10_INT_ENA_S)
#define SDIO_SLC_FRHOST_BIT10_INT_ENA_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT10_INT_ENA_S  2
/** SDIO_SLC_FRHOST_BIT11_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enable bit for SLC_FRHOST_BIT3_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT11_INT_ENA    (BIT(3))
#define SDIO_SLC_FRHOST_BIT11_INT_ENA_M  (SDIO_SLC_FRHOST_BIT11_INT_ENA_V << SDIO_SLC_FRHOST_BIT11_INT_ENA_S)
#define SDIO_SLC_FRHOST_BIT11_INT_ENA_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT11_INT_ENA_S  3
/** SDIO_SLC_FRHOST_BIT12_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The interrupt enable bit for SLC_FRHOST_BIT4_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT12_INT_ENA    (BIT(4))
#define SDIO_SLC_FRHOST_BIT12_INT_ENA_M  (SDIO_SLC_FRHOST_BIT12_INT_ENA_V << SDIO_SLC_FRHOST_BIT12_INT_ENA_S)
#define SDIO_SLC_FRHOST_BIT12_INT_ENA_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT12_INT_ENA_S  4
/** SDIO_SLC_FRHOST_BIT13_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The interrupt enable bit for SLC_FRHOST_BIT5_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT13_INT_ENA    (BIT(5))
#define SDIO_SLC_FRHOST_BIT13_INT_ENA_M  (SDIO_SLC_FRHOST_BIT13_INT_ENA_V << SDIO_SLC_FRHOST_BIT13_INT_ENA_S)
#define SDIO_SLC_FRHOST_BIT13_INT_ENA_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT13_INT_ENA_S  5
/** SDIO_SLC_FRHOST_BIT14_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  The interrupt enable bit for SLC_FRHOST_BIT6_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT14_INT_ENA    (BIT(6))
#define SDIO_SLC_FRHOST_BIT14_INT_ENA_M  (SDIO_SLC_FRHOST_BIT14_INT_ENA_V << SDIO_SLC_FRHOST_BIT14_INT_ENA_S)
#define SDIO_SLC_FRHOST_BIT14_INT_ENA_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT14_INT_ENA_S  6
/** SDIO_SLC_FRHOST_BIT15_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The interrupt enable bit for SLC_FRHOST_BIT7_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT15_INT_ENA    (BIT(7))
#define SDIO_SLC_FRHOST_BIT15_INT_ENA_M  (SDIO_SLC_FRHOST_BIT15_INT_ENA_V << SDIO_SLC_FRHOST_BIT15_INT_ENA_S)
#define SDIO_SLC_FRHOST_BIT15_INT_ENA_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT15_INT_ENA_S  7
/** SDIO_SLC1_RX_START_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The interrupt enable bit for SCL1_RX_START_INT_ST interrupt.
 */
#define SDIO_SLC1_RX_START_INT_ENA    (BIT(8))
#define SDIO_SLC1_RX_START_INT_ENA_M  (SDIO_SLC1_RX_START_INT_ENA_V << SDIO_SLC1_RX_START_INT_ENA_S)
#define SDIO_SLC1_RX_START_INT_ENA_V  0x00000001U
#define SDIO_SLC1_RX_START_INT_ENA_S  8
/** SDIO_SLC1_TX_START_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  The interrupt enable bit for SCL1_TX_START_INT_ST interrupt.
 */
#define SDIO_SLC1_TX_START_INT_ENA    (BIT(9))
#define SDIO_SLC1_TX_START_INT_ENA_M  (SDIO_SLC1_TX_START_INT_ENA_V << SDIO_SLC1_TX_START_INT_ENA_S)
#define SDIO_SLC1_TX_START_INT_ENA_V  0x00000001U
#define SDIO_SLC1_TX_START_INT_ENA_S  9
/** SDIO_SLC1_RX_UDF_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  The interrupt enable bit for SCL1_RX_UDF_INT interrupt.
 */
#define SDIO_SLC1_RX_UDF_INT_ENA    (BIT(10))
#define SDIO_SLC1_RX_UDF_INT_ENA_M  (SDIO_SLC1_RX_UDF_INT_ENA_V << SDIO_SLC1_RX_UDF_INT_ENA_S)
#define SDIO_SLC1_RX_UDF_INT_ENA_V  0x00000001U
#define SDIO_SLC1_RX_UDF_INT_ENA_S  10
/** SDIO_SLC1_TX_OVF_INT_ENA : R/W; bitpos: [11]; default: 0;
 *  The interrupt enable bit for SCL1_TX_OVF_INT interrupt.
 */
#define SDIO_SLC1_TX_OVF_INT_ENA    (BIT(11))
#define SDIO_SLC1_TX_OVF_INT_ENA_M  (SDIO_SLC1_TX_OVF_INT_ENA_V << SDIO_SLC1_TX_OVF_INT_ENA_S)
#define SDIO_SLC1_TX_OVF_INT_ENA_V  0x00000001U
#define SDIO_SLC1_TX_OVF_INT_ENA_S  11
/** SDIO_SLC1_TOKEN0_1TO0_INT_ENA : R/W; bitpos: [12]; default: 0;
 *  The interrupt enable bit for SCL1_TOKEN0_1TO0_INT interrupt.
 */
#define SDIO_SLC1_TOKEN0_1TO0_INT_ENA    (BIT(12))
#define SDIO_SLC1_TOKEN0_1TO0_INT_ENA_M  (SDIO_SLC1_TOKEN0_1TO0_INT_ENA_V << SDIO_SLC1_TOKEN0_1TO0_INT_ENA_S)
#define SDIO_SLC1_TOKEN0_1TO0_INT_ENA_V  0x00000001U
#define SDIO_SLC1_TOKEN0_1TO0_INT_ENA_S  12
/** SDIO_SLC1_TOKEN1_1TO0_INT_ENA : R/W; bitpos: [13]; default: 0;
 *  The interrupt enable bit for SCL1_TOKEN1_1TO0_INT interrupt.
 */
#define SDIO_SLC1_TOKEN1_1TO0_INT_ENA    (BIT(13))
#define SDIO_SLC1_TOKEN1_1TO0_INT_ENA_M  (SDIO_SLC1_TOKEN1_1TO0_INT_ENA_V << SDIO_SLC1_TOKEN1_1TO0_INT_ENA_S)
#define SDIO_SLC1_TOKEN1_1TO0_INT_ENA_V  0x00000001U
#define SDIO_SLC1_TOKEN1_1TO0_INT_ENA_S  13
/** SDIO_SLC1_TX_DONE_INT_ENA : R/W; bitpos: [14]; default: 0;
 *  The interrupt enable bit for SCL1_TX_DONE_INT_ST interrupt.
 */
#define SDIO_SLC1_TX_DONE_INT_ENA    (BIT(14))
#define SDIO_SLC1_TX_DONE_INT_ENA_M  (SDIO_SLC1_TX_DONE_INT_ENA_V << SDIO_SLC1_TX_DONE_INT_ENA_S)
#define SDIO_SLC1_TX_DONE_INT_ENA_V  0x00000001U
#define SDIO_SLC1_TX_DONE_INT_ENA_S  14
/** SDIO_SLC1_TX_SUC_EOF_INT_ENA : R/W; bitpos: [15]; default: 0;
 *  The interrupt enable bit for SCL1_TX_SUC_EOF_INT interrupt.
 */
#define SDIO_SLC1_TX_SUC_EOF_INT_ENA    (BIT(15))
#define SDIO_SLC1_TX_SUC_EOF_INT_ENA_M  (SDIO_SLC1_TX_SUC_EOF_INT_ENA_V << SDIO_SLC1_TX_SUC_EOF_INT_ENA_S)
#define SDIO_SLC1_TX_SUC_EOF_INT_ENA_V  0x00000001U
#define SDIO_SLC1_TX_SUC_EOF_INT_ENA_S  15
/** SDIO_SLC1_RX_DONE_INT_ENA : R/W; bitpos: [16]; default: 0;
 *  The interrupt enable bit for SCL1_RX_DONE_INT interrupt.
 */
#define SDIO_SLC1_RX_DONE_INT_ENA    (BIT(16))
#define SDIO_SLC1_RX_DONE_INT_ENA_M  (SDIO_SLC1_RX_DONE_INT_ENA_V << SDIO_SLC1_RX_DONE_INT_ENA_S)
#define SDIO_SLC1_RX_DONE_INT_ENA_V  0x00000001U
#define SDIO_SLC1_RX_DONE_INT_ENA_S  16
/** SDIO_SLC1_RX_EOF_INT_ENA : R/W; bitpos: [17]; default: 0;
 *  The interrupt enable bit for SCL1_RX_EOF_INT interrupt.
 */
#define SDIO_SLC1_RX_EOF_INT_ENA    (BIT(17))
#define SDIO_SLC1_RX_EOF_INT_ENA_M  (SDIO_SLC1_RX_EOF_INT_ENA_V << SDIO_SLC1_RX_EOF_INT_ENA_S)
#define SDIO_SLC1_RX_EOF_INT_ENA_V  0x00000001U
#define SDIO_SLC1_RX_EOF_INT_ENA_S  17
/** SDIO_SLC1_TOHOST_INT_ENA : R/W; bitpos: [18]; default: 0;
 *  The interrupt enable bit for SCL1_TOHOST_INT interrupt.
 */
#define SDIO_SLC1_TOHOST_INT_ENA    (BIT(18))
#define SDIO_SLC1_TOHOST_INT_ENA_M  (SDIO_SLC1_TOHOST_INT_ENA_V << SDIO_SLC1_TOHOST_INT_ENA_S)
#define SDIO_SLC1_TOHOST_INT_ENA_V  0x00000001U
#define SDIO_SLC1_TOHOST_INT_ENA_S  18
/** SDIO_SLC1_TX_DSCR_ERR_INT_ENA : R/W; bitpos: [19]; default: 0;
 *  The interrupt enable bit for SCL1_TX_DSCR_ERR_INT interrupt.
 */
#define SDIO_SLC1_TX_DSCR_ERR_INT_ENA    (BIT(19))
#define SDIO_SLC1_TX_DSCR_ERR_INT_ENA_M  (SDIO_SLC1_TX_DSCR_ERR_INT_ENA_V << SDIO_SLC1_TX_DSCR_ERR_INT_ENA_S)
#define SDIO_SLC1_TX_DSCR_ERR_INT_ENA_V  0x00000001U
#define SDIO_SLC1_TX_DSCR_ERR_INT_ENA_S  19
/** SDIO_SLC1_RX_DSCR_ERR_INT_ENA : R/W; bitpos: [20]; default: 0;
 *  The interrupt enable bit for SCL1_RX_DSCR_ERR_INT interrupt.
 */
#define SDIO_SLC1_RX_DSCR_ERR_INT_ENA    (BIT(20))
#define SDIO_SLC1_RX_DSCR_ERR_INT_ENA_M  (SDIO_SLC1_RX_DSCR_ERR_INT_ENA_V << SDIO_SLC1_RX_DSCR_ERR_INT_ENA_S)
#define SDIO_SLC1_RX_DSCR_ERR_INT_ENA_V  0x00000001U
#define SDIO_SLC1_RX_DSCR_ERR_INT_ENA_S  20
/** SDIO_SLC1_TX_DSCR_EMPTY_INT_ENA : R/W; bitpos: [21]; default: 0;
 *  The interrupt enable bit for SCL1_TX_DSCR_EMPTY_INT interrupt.
 */
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_ENA    (BIT(21))
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_ENA_M  (SDIO_SLC1_TX_DSCR_EMPTY_INT_ENA_V << SDIO_SLC1_TX_DSCR_EMPTY_INT_ENA_S)
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_ENA_V  0x00000001U
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_ENA_S  21
/** SDIO_SLC1_HOST_RD_ACK_INT_ENA : R/W; bitpos: [22]; default: 0;
 *  The interrupt enable bit for SCL1_HOST_RD_ACK_INT interrupt.
 */
#define SDIO_SLC1_HOST_RD_ACK_INT_ENA    (BIT(22))
#define SDIO_SLC1_HOST_RD_ACK_INT_ENA_M  (SDIO_SLC1_HOST_RD_ACK_INT_ENA_V << SDIO_SLC1_HOST_RD_ACK_INT_ENA_S)
#define SDIO_SLC1_HOST_RD_ACK_INT_ENA_V  0x00000001U
#define SDIO_SLC1_HOST_RD_ACK_INT_ENA_S  22
/** SDIO_SLC1_WR_RETRY_DONE_INT_ENA : R/W; bitpos: [23]; default: 0;
 *  The interrupt enable bit for SCL1_WR_RETRY_DONE_INT interrupt.
 */
#define SDIO_SLC1_WR_RETRY_DONE_INT_ENA    (BIT(23))
#define SDIO_SLC1_WR_RETRY_DONE_INT_ENA_M  (SDIO_SLC1_WR_RETRY_DONE_INT_ENA_V << SDIO_SLC1_WR_RETRY_DONE_INT_ENA_S)
#define SDIO_SLC1_WR_RETRY_DONE_INT_ENA_V  0x00000001U
#define SDIO_SLC1_WR_RETRY_DONE_INT_ENA_S  23
/** SDIO_SLC1_TX_ERR_EOF_INT_ENA : R/W; bitpos: [24]; default: 0;
 *  The interrupt enable bit for SCL1_TX_ERR_EOF_INT interrupt.
 */
#define SDIO_SLC1_TX_ERR_EOF_INT_ENA    (BIT(24))
#define SDIO_SLC1_TX_ERR_EOF_INT_ENA_M  (SDIO_SLC1_TX_ERR_EOF_INT_ENA_V << SDIO_SLC1_TX_ERR_EOF_INT_ENA_S)
#define SDIO_SLC1_TX_ERR_EOF_INT_ENA_V  0x00000001U
#define SDIO_SLC1_TX_ERR_EOF_INT_ENA_S  24

/** SDIO_SLC_SLC1INT_CLR_REG register
 *  Sdio slave DMA channel1 interrupt clear register.
 */
#define SDIO_SLC_SLC1INT_CLR_REG (DR_REG_SDIO_BASE + 0x20)
/** SDIO_SLC_FRHOST_BIT8_INT_CLR : WT; bitpos: [0]; default: 0;
 *  Set this bit to clear SLC_FRHOST_BIT0_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT8_INT_CLR    (BIT(0))
#define SDIO_SLC_FRHOST_BIT8_INT_CLR_M  (SDIO_SLC_FRHOST_BIT8_INT_CLR_V << SDIO_SLC_FRHOST_BIT8_INT_CLR_S)
#define SDIO_SLC_FRHOST_BIT8_INT_CLR_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT8_INT_CLR_S  0
/** SDIO_SLC_FRHOST_BIT9_INT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear SLC_FRHOST_BIT1_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT9_INT_CLR    (BIT(1))
#define SDIO_SLC_FRHOST_BIT9_INT_CLR_M  (SDIO_SLC_FRHOST_BIT9_INT_CLR_V << SDIO_SLC_FRHOST_BIT9_INT_CLR_S)
#define SDIO_SLC_FRHOST_BIT9_INT_CLR_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT9_INT_CLR_S  1
/** SDIO_SLC_FRHOST_BIT10_INT_CLR : WT; bitpos: [2]; default: 0;
 *  Set this bit to clear SLC_FRHOST_BIT2_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT10_INT_CLR    (BIT(2))
#define SDIO_SLC_FRHOST_BIT10_INT_CLR_M  (SDIO_SLC_FRHOST_BIT10_INT_CLR_V << SDIO_SLC_FRHOST_BIT10_INT_CLR_S)
#define SDIO_SLC_FRHOST_BIT10_INT_CLR_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT10_INT_CLR_S  2
/** SDIO_SLC_FRHOST_BIT11_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Set this bit to clear SLC_FRHOST_BIT3_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT11_INT_CLR    (BIT(3))
#define SDIO_SLC_FRHOST_BIT11_INT_CLR_M  (SDIO_SLC_FRHOST_BIT11_INT_CLR_V << SDIO_SLC_FRHOST_BIT11_INT_CLR_S)
#define SDIO_SLC_FRHOST_BIT11_INT_CLR_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT11_INT_CLR_S  3
/** SDIO_SLC_FRHOST_BIT12_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Set this bit to clear SLC_FRHOST_BIT4_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT12_INT_CLR    (BIT(4))
#define SDIO_SLC_FRHOST_BIT12_INT_CLR_M  (SDIO_SLC_FRHOST_BIT12_INT_CLR_V << SDIO_SLC_FRHOST_BIT12_INT_CLR_S)
#define SDIO_SLC_FRHOST_BIT12_INT_CLR_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT12_INT_CLR_S  4
/** SDIO_SLC_FRHOST_BIT13_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Set this bit to clear SLC_FRHOST_BIT5_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT13_INT_CLR    (BIT(5))
#define SDIO_SLC_FRHOST_BIT13_INT_CLR_M  (SDIO_SLC_FRHOST_BIT13_INT_CLR_V << SDIO_SLC_FRHOST_BIT13_INT_CLR_S)
#define SDIO_SLC_FRHOST_BIT13_INT_CLR_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT13_INT_CLR_S  5
/** SDIO_SLC_FRHOST_BIT14_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Set this bit to clear SLC_FRHOST_BIT6_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT14_INT_CLR    (BIT(6))
#define SDIO_SLC_FRHOST_BIT14_INT_CLR_M  (SDIO_SLC_FRHOST_BIT14_INT_CLR_V << SDIO_SLC_FRHOST_BIT14_INT_CLR_S)
#define SDIO_SLC_FRHOST_BIT14_INT_CLR_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT14_INT_CLR_S  6
/** SDIO_SLC_FRHOST_BIT15_INT_CLR : WT; bitpos: [7]; default: 0;
 *  Set this bit to clear SLC_FRHOST_BIT7_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT15_INT_CLR    (BIT(7))
#define SDIO_SLC_FRHOST_BIT15_INT_CLR_M  (SDIO_SLC_FRHOST_BIT15_INT_CLR_V << SDIO_SLC_FRHOST_BIT15_INT_CLR_S)
#define SDIO_SLC_FRHOST_BIT15_INT_CLR_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT15_INT_CLR_S  7
/** SDIO_SLC1_RX_START_INT_CLR : WT; bitpos: [8]; default: 0;
 *  Set this bit to clear SLC1_RX_START_INT_ST interrupt.
 */
#define SDIO_SLC1_RX_START_INT_CLR    (BIT(8))
#define SDIO_SLC1_RX_START_INT_CLR_M  (SDIO_SLC1_RX_START_INT_CLR_V << SDIO_SLC1_RX_START_INT_CLR_S)
#define SDIO_SLC1_RX_START_INT_CLR_V  0x00000001U
#define SDIO_SLC1_RX_START_INT_CLR_S  8
/** SDIO_SLC1_TX_START_INT_CLR : WT; bitpos: [9]; default: 0;
 *  Set this bit to clear SLC1_TX_START_INT_ST interrupt.
 */
#define SDIO_SLC1_TX_START_INT_CLR    (BIT(9))
#define SDIO_SLC1_TX_START_INT_CLR_M  (SDIO_SLC1_TX_START_INT_CLR_V << SDIO_SLC1_TX_START_INT_CLR_S)
#define SDIO_SLC1_TX_START_INT_CLR_V  0x00000001U
#define SDIO_SLC1_TX_START_INT_CLR_S  9
/** SDIO_SLC1_RX_UDF_INT_CLR : WT; bitpos: [10]; default: 0;
 *  Set this bit to clear SLC1_RX_UDF_INT interrupt.
 */
#define SDIO_SLC1_RX_UDF_INT_CLR    (BIT(10))
#define SDIO_SLC1_RX_UDF_INT_CLR_M  (SDIO_SLC1_RX_UDF_INT_CLR_V << SDIO_SLC1_RX_UDF_INT_CLR_S)
#define SDIO_SLC1_RX_UDF_INT_CLR_V  0x00000001U
#define SDIO_SLC1_RX_UDF_INT_CLR_S  10
/** SDIO_SLC1_TX_OVF_INT_CLR : WT; bitpos: [11]; default: 0;
 *  Set this bit to clear SLC1_TX_OVF_INT interrupt.
 */
#define SDIO_SLC1_TX_OVF_INT_CLR    (BIT(11))
#define SDIO_SLC1_TX_OVF_INT_CLR_M  (SDIO_SLC1_TX_OVF_INT_CLR_V << SDIO_SLC1_TX_OVF_INT_CLR_S)
#define SDIO_SLC1_TX_OVF_INT_CLR_V  0x00000001U
#define SDIO_SLC1_TX_OVF_INT_CLR_S  11
/** SDIO_SLC1_TOKEN0_1TO0_INT_CLR : WT; bitpos: [12]; default: 0;
 *  Set this bit to clear SLC1_TOKEN0_1TO0_INT interrupt.
 */
#define SDIO_SLC1_TOKEN0_1TO0_INT_CLR    (BIT(12))
#define SDIO_SLC1_TOKEN0_1TO0_INT_CLR_M  (SDIO_SLC1_TOKEN0_1TO0_INT_CLR_V << SDIO_SLC1_TOKEN0_1TO0_INT_CLR_S)
#define SDIO_SLC1_TOKEN0_1TO0_INT_CLR_V  0x00000001U
#define SDIO_SLC1_TOKEN0_1TO0_INT_CLR_S  12
/** SDIO_SLC1_TOKEN1_1TO0_INT_CLR : WT; bitpos: [13]; default: 0;
 *  Set this bit to clear SLC1_TOKEN1_1TO0_INT interrupt.
 */
#define SDIO_SLC1_TOKEN1_1TO0_INT_CLR    (BIT(13))
#define SDIO_SLC1_TOKEN1_1TO0_INT_CLR_M  (SDIO_SLC1_TOKEN1_1TO0_INT_CLR_V << SDIO_SLC1_TOKEN1_1TO0_INT_CLR_S)
#define SDIO_SLC1_TOKEN1_1TO0_INT_CLR_V  0x00000001U
#define SDIO_SLC1_TOKEN1_1TO0_INT_CLR_S  13
/** SDIO_SLC1_TX_DONE_INT_CLR : WT; bitpos: [14]; default: 0;
 *  Set this bit to clear SLC1_TX_DONE_INT_ST interrupt.
 */
#define SDIO_SLC1_TX_DONE_INT_CLR    (BIT(14))
#define SDIO_SLC1_TX_DONE_INT_CLR_M  (SDIO_SLC1_TX_DONE_INT_CLR_V << SDIO_SLC1_TX_DONE_INT_CLR_S)
#define SDIO_SLC1_TX_DONE_INT_CLR_V  0x00000001U
#define SDIO_SLC1_TX_DONE_INT_CLR_S  14
/** SDIO_SLC1_TX_SUC_EOF_INT_CLR : WT; bitpos: [15]; default: 0;
 *  Set this bit to clear SLC1_TX_SUC_EOF_INT interrupt.
 */
#define SDIO_SLC1_TX_SUC_EOF_INT_CLR    (BIT(15))
#define SDIO_SLC1_TX_SUC_EOF_INT_CLR_M  (SDIO_SLC1_TX_SUC_EOF_INT_CLR_V << SDIO_SLC1_TX_SUC_EOF_INT_CLR_S)
#define SDIO_SLC1_TX_SUC_EOF_INT_CLR_V  0x00000001U
#define SDIO_SLC1_TX_SUC_EOF_INT_CLR_S  15
/** SDIO_SLC1_RX_DONE_INT_CLR : WT; bitpos: [16]; default: 0;
 *  Set this bit to clear SLC1_RX_DONE_INT interrupt.
 */
#define SDIO_SLC1_RX_DONE_INT_CLR    (BIT(16))
#define SDIO_SLC1_RX_DONE_INT_CLR_M  (SDIO_SLC1_RX_DONE_INT_CLR_V << SDIO_SLC1_RX_DONE_INT_CLR_S)
#define SDIO_SLC1_RX_DONE_INT_CLR_V  0x00000001U
#define SDIO_SLC1_RX_DONE_INT_CLR_S  16
/** SDIO_SLC1_RX_EOF_INT_CLR : WT; bitpos: [17]; default: 0;
 *  Set this bit to clear SLC1_RX_EOF_INT interrupt.
 */
#define SDIO_SLC1_RX_EOF_INT_CLR    (BIT(17))
#define SDIO_SLC1_RX_EOF_INT_CLR_M  (SDIO_SLC1_RX_EOF_INT_CLR_V << SDIO_SLC1_RX_EOF_INT_CLR_S)
#define SDIO_SLC1_RX_EOF_INT_CLR_V  0x00000001U
#define SDIO_SLC1_RX_EOF_INT_CLR_S  17
/** SDIO_SLC1_TOHOST_INT_CLR : WT; bitpos: [18]; default: 0;
 *  Set this bit to clear SLC1_TOHOST_INT interrupt.
 */
#define SDIO_SLC1_TOHOST_INT_CLR    (BIT(18))
#define SDIO_SLC1_TOHOST_INT_CLR_M  (SDIO_SLC1_TOHOST_INT_CLR_V << SDIO_SLC1_TOHOST_INT_CLR_S)
#define SDIO_SLC1_TOHOST_INT_CLR_V  0x00000001U
#define SDIO_SLC1_TOHOST_INT_CLR_S  18
/** SDIO_SLC1_TX_DSCR_ERR_INT_CLR : WT; bitpos: [19]; default: 0;
 *  Set this bit to clear SLC1_TX_DSCR_ERR_INT interrupt.
 */
#define SDIO_SLC1_TX_DSCR_ERR_INT_CLR    (BIT(19))
#define SDIO_SLC1_TX_DSCR_ERR_INT_CLR_M  (SDIO_SLC1_TX_DSCR_ERR_INT_CLR_V << SDIO_SLC1_TX_DSCR_ERR_INT_CLR_S)
#define SDIO_SLC1_TX_DSCR_ERR_INT_CLR_V  0x00000001U
#define SDIO_SLC1_TX_DSCR_ERR_INT_CLR_S  19
/** SDIO_SLC1_RX_DSCR_ERR_INT_CLR : WT; bitpos: [20]; default: 0;
 *  Set this bit to clear SLC1_RX_DSCR_ERR_INT interrupt.
 */
#define SDIO_SLC1_RX_DSCR_ERR_INT_CLR    (BIT(20))
#define SDIO_SLC1_RX_DSCR_ERR_INT_CLR_M  (SDIO_SLC1_RX_DSCR_ERR_INT_CLR_V << SDIO_SLC1_RX_DSCR_ERR_INT_CLR_S)
#define SDIO_SLC1_RX_DSCR_ERR_INT_CLR_V  0x00000001U
#define SDIO_SLC1_RX_DSCR_ERR_INT_CLR_S  20
/** SDIO_SLC1_TX_DSCR_EMPTY_INT_CLR : WT; bitpos: [21]; default: 0;
 *  Set this bit to clear SLC1_TX_DSCR_EMPTY_INT interrupt.
 */
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_CLR    (BIT(21))
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_CLR_M  (SDIO_SLC1_TX_DSCR_EMPTY_INT_CLR_V << SDIO_SLC1_TX_DSCR_EMPTY_INT_CLR_S)
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_CLR_V  0x00000001U
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_CLR_S  21
/** SDIO_SLC1_HOST_RD_ACK_INT_CLR : WT; bitpos: [22]; default: 0;
 *  Set this bit to clear SLC1_HOST_RD_ACK_INT interrupt.
 */
#define SDIO_SLC1_HOST_RD_ACK_INT_CLR    (BIT(22))
#define SDIO_SLC1_HOST_RD_ACK_INT_CLR_M  (SDIO_SLC1_HOST_RD_ACK_INT_CLR_V << SDIO_SLC1_HOST_RD_ACK_INT_CLR_S)
#define SDIO_SLC1_HOST_RD_ACK_INT_CLR_V  0x00000001U
#define SDIO_SLC1_HOST_RD_ACK_INT_CLR_S  22
/** SDIO_SLC1_WR_RETRY_DONE_INT_CLR : WT; bitpos: [23]; default: 0;
 *  Set this bit to clear SLC1_WR_RETRY_DONE_INT interrupt.
 */
#define SDIO_SLC1_WR_RETRY_DONE_INT_CLR    (BIT(23))
#define SDIO_SLC1_WR_RETRY_DONE_INT_CLR_M  (SDIO_SLC1_WR_RETRY_DONE_INT_CLR_V << SDIO_SLC1_WR_RETRY_DONE_INT_CLR_S)
#define SDIO_SLC1_WR_RETRY_DONE_INT_CLR_V  0x00000001U
#define SDIO_SLC1_WR_RETRY_DONE_INT_CLR_S  23
/** SDIO_SLC1_TX_ERR_EOF_INT_CLR : WT; bitpos: [24]; default: 0;
 *  Set this bit to clear SLC1_TX_ERR_EOF_INT interrupt.
 */
#define SDIO_SLC1_TX_ERR_EOF_INT_CLR    (BIT(24))
#define SDIO_SLC1_TX_ERR_EOF_INT_CLR_M  (SDIO_SLC1_TX_ERR_EOF_INT_CLR_V << SDIO_SLC1_TX_ERR_EOF_INT_CLR_S)
#define SDIO_SLC1_TX_ERR_EOF_INT_CLR_V  0x00000001U
#define SDIO_SLC1_TX_ERR_EOF_INT_CLR_S  24

/** SDIO_SLC_RX_STATUS_REG register
 *  Sdio slave DMA rxfifo status register.
 */
#define SDIO_SLC_RX_STATUS_REG (DR_REG_SDIO_BASE + 0x24)
/** SDIO_SLC0_RX_FULL : RO; bitpos: [0]; default: 0;
 *  The status bit for rxfifo full during slave sending data to host through dma
 *  channel0.
 */
#define SDIO_SLC0_RX_FULL    (BIT(0))
#define SDIO_SLC0_RX_FULL_M  (SDIO_SLC0_RX_FULL_V << SDIO_SLC0_RX_FULL_S)
#define SDIO_SLC0_RX_FULL_V  0x00000001U
#define SDIO_SLC0_RX_FULL_S  0
/** SDIO_SLC0_RX_EMPTY : RO; bitpos: [1]; default: 1;
 *  The status bit for rxfifo empty during slave sending data to host through dma
 *  channel0.
 */
#define SDIO_SLC0_RX_EMPTY    (BIT(1))
#define SDIO_SLC0_RX_EMPTY_M  (SDIO_SLC0_RX_EMPTY_V << SDIO_SLC0_RX_EMPTY_S)
#define SDIO_SLC0_RX_EMPTY_V  0x00000001U
#define SDIO_SLC0_RX_EMPTY_S  1
/** SDIO_SLC0_RX_BUF_LEN : RO; bitpos: [15:2]; default: 0;
 *  the current buffer length during slave sending data to host through dma channel0.
 */
#define SDIO_SLC0_RX_BUF_LEN    0x00003FFFU
#define SDIO_SLC0_RX_BUF_LEN_M  (SDIO_SLC0_RX_BUF_LEN_V << SDIO_SLC0_RX_BUF_LEN_S)
#define SDIO_SLC0_RX_BUF_LEN_V  0x00003FFFU
#define SDIO_SLC0_RX_BUF_LEN_S  2
/** SDIO_SLC1_RX_FULL : RO; bitpos: [16]; default: 0;
 *  The status bit for rxfifo full during slave sending data to host through dma
 *  channel1.
 */
#define SDIO_SLC1_RX_FULL    (BIT(16))
#define SDIO_SLC1_RX_FULL_M  (SDIO_SLC1_RX_FULL_V << SDIO_SLC1_RX_FULL_S)
#define SDIO_SLC1_RX_FULL_V  0x00000001U
#define SDIO_SLC1_RX_FULL_S  16
/** SDIO_SLC1_RX_EMPTY : RO; bitpos: [17]; default: 1;
 *  The status bit for rxfifo empty during slave sending data to host through dma
 *  channel1.
 */
#define SDIO_SLC1_RX_EMPTY    (BIT(17))
#define SDIO_SLC1_RX_EMPTY_M  (SDIO_SLC1_RX_EMPTY_V << SDIO_SLC1_RX_EMPTY_S)
#define SDIO_SLC1_RX_EMPTY_V  0x00000001U
#define SDIO_SLC1_RX_EMPTY_S  17
/** SDIO_SLC1_RX_BUF_LEN : RO; bitpos: [31:18]; default: 0;
 *  the current buffer length during slave sending data to host through dma channel1.
 */
#define SDIO_SLC1_RX_BUF_LEN    0x00003FFFU
#define SDIO_SLC1_RX_BUF_LEN_M  (SDIO_SLC1_RX_BUF_LEN_V << SDIO_SLC1_RX_BUF_LEN_S)
#define SDIO_SLC1_RX_BUF_LEN_V  0x00003FFFU
#define SDIO_SLC1_RX_BUF_LEN_S  18

/** SDIO_SLC_SLC0RXFIFO_PUSH_REG register
 *  Sdio slave DMA channel0 rxfifo debug register.
 */
#define SDIO_SLC_SLC0RXFIFO_PUSH_REG (DR_REG_SDIO_BASE + 0x28)
/** SDIO_SLC0_RXFIFO_WDATA : R/W; bitpos: [8:0]; default: 0;
 *  The data used to sent into rxfifo through APB bus.
 */
#define SDIO_SLC0_RXFIFO_WDATA    0x000001FFU
#define SDIO_SLC0_RXFIFO_WDATA_M  (SDIO_SLC0_RXFIFO_WDATA_V << SDIO_SLC0_RXFIFO_WDATA_S)
#define SDIO_SLC0_RXFIFO_WDATA_V  0x000001FFU
#define SDIO_SLC0_RXFIFO_WDATA_S  0
/** SDIO_SLC0_RXFIFO_PUSH : R/W/SC; bitpos: [16]; default: 0;
 *  Set this bit to send slc0_rxfifo_wdata into rxfifo through APB bus. This bit is
 *  cleared automatically after sending one data to slc0_rxfifo through APB bus
 *  successfully.
 */
#define SDIO_SLC0_RXFIFO_PUSH    (BIT(16))
#define SDIO_SLC0_RXFIFO_PUSH_M  (SDIO_SLC0_RXFIFO_PUSH_V << SDIO_SLC0_RXFIFO_PUSH_S)
#define SDIO_SLC0_RXFIFO_PUSH_V  0x00000001U
#define SDIO_SLC0_RXFIFO_PUSH_S  16

/** SDIO_SLC_SLC1RXFIFO_PUSH_REG register
 *  Sdio slave DMA channel1 rxfifo debug register.
 */
#define SDIO_SLC_SLC1RXFIFO_PUSH_REG (DR_REG_SDIO_BASE + 0x2c)
/** SDIO_SLC1_RXFIFO_WDATA : R/W; bitpos: [8:0]; default: 0;
 *  The data used to sent into rxfifo through APB bus.
 */
#define SDIO_SLC1_RXFIFO_WDATA    0x000001FFU
#define SDIO_SLC1_RXFIFO_WDATA_M  (SDIO_SLC1_RXFIFO_WDATA_V << SDIO_SLC1_RXFIFO_WDATA_S)
#define SDIO_SLC1_RXFIFO_WDATA_V  0x000001FFU
#define SDIO_SLC1_RXFIFO_WDATA_S  0
/** SDIO_SLC1_RXFIFO_PUSH : R/W/SC; bitpos: [16]; default: 0;
 *  Set this bit to send slc1_rxfifo_wdata into rxfifo through APB bus. This bit is
 *  cleared automatically after sending one data to slc1_rxfifo through APB bus
 *  successfully.
 */
#define SDIO_SLC1_RXFIFO_PUSH    (BIT(16))
#define SDIO_SLC1_RXFIFO_PUSH_M  (SDIO_SLC1_RXFIFO_PUSH_V << SDIO_SLC1_RXFIFO_PUSH_S)
#define SDIO_SLC1_RXFIFO_PUSH_V  0x00000001U
#define SDIO_SLC1_RXFIFO_PUSH_S  16

