espressif/esp-idf/components/soc/esp32c5/register/soc/sdio_slc_reg.h
/** SDIO_SLC_SLC1RX_LINK_REG register
 *  Sdio slave DMA channel1 configuration and status register of link list for slave
 *  sending data.
 */
#define SDIO_SLC_SLC1RX_LINK_REG (DR_REG_SDIO_BASE + 0x4c)
/** SDIO_SLC1_BT_PACKET : R/W; bitpos: [20]; default: 1;
 *  Configure the packet type for slave to send: 0- wifi packet, 1- blue-tooth packet.
 */
#define SDIO_SLC1_BT_PACKET    (BIT(20))
#define SDIO_SLC1_BT_PACKET_M  (SDIO_SLC1_BT_PACKET_V << SDIO_SLC1_BT_PACKET_S)
#define SDIO_SLC1_BT_PACKET_V  0x00000001U
#define SDIO_SLC1_BT_PACKET_S  20
/** SDIO_SLC1_RXLINK_STOP : R/W/SC; bitpos: [28]; default: 0;
 *  Set 1 to stop the linked list operation for dma channel1 sending packets.
 */
#define SDIO_SLC1_RXLINK_STOP    (BIT(28))
#define SDIO_SLC1_RXLINK_STOP_M  (SDIO_SLC1_RXLINK_STOP_V << SDIO_SLC1_RXLINK_STOP_S)
#define SDIO_SLC1_RXLINK_STOP_V  0x00000001U
#define SDIO_SLC1_RXLINK_STOP_S  28
/** SDIO_SLC1_RXLINK_START : R/W/SC; bitpos: [29]; default: 0;
 *  Set 1 to start the linked list operation for dma channel1 sending packets. Sending
 *  will start from address indicated by SLC0_RXLINK_ADDR.
 */
#define SDIO_SLC1_RXLINK_START    (BIT(29))
#define SDIO_SLC1_RXLINK_START_M  (SDIO_SLC1_RXLINK_START_V << SDIO_SLC1_RXLINK_START_S)
#define SDIO_SLC1_RXLINK_START_V  0x00000001U
#define SDIO_SLC1_RXLINK_START_S  29
/** SDIO_SLC1_RXLINK_RESTART : R/W/SC; bitpos: [30]; default: 0;
 *  Set 1 to restart and continue the linked list operation for dma channel1 sending
 *  packets.
 */
#define SDIO_SLC1_RXLINK_RESTART    (BIT(30))
#define SDIO_SLC1_RXLINK_RESTART_M  (SDIO_SLC1_RXLINK_RESTART_V << SDIO_SLC1_RXLINK_RESTART_S)
#define SDIO_SLC1_RXLINK_RESTART_V  0x00000001U
#define SDIO_SLC1_RXLINK_RESTART_S  30
/** SDIO_SLC1_RXLINK_PARK : RO; bitpos: [31]; default: 1;
 *  The status bit for sending link list fsm of dma channel1 in idle state
 */
#define SDIO_SLC1_RXLINK_PARK    (BIT(31))
#define SDIO_SLC1_RXLINK_PARK_M  (SDIO_SLC1_RXLINK_PARK_V << SDIO_SLC1_RXLINK_PARK_S)
#define SDIO_SLC1_RXLINK_PARK_V  0x00000001U
#define SDIO_SLC1_RXLINK_PARK_S  31

/** SDIO_SLC_SLC1RX_LINK_ADDR_REG register
 *  Sdio slave DMA channel1 address of first descriptor of sending link list.
 */
#define SDIO_SLC_SLC1RX_LINK_ADDR_REG (DR_REG_SDIO_BASE + 0x50)
/** SDIO_SLC1_RXLINK_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  The initial address of dma channel1's sending linked list.
 */
#define SDIO_SLC1_RXLINK_ADDR    0xFFFFFFFFU
#define SDIO_SLC1_RXLINK_ADDR_M  (SDIO_SLC1_RXLINK_ADDR_V << SDIO_SLC1_RXLINK_ADDR_S)
#define SDIO_SLC1_RXLINK_ADDR_V  0xFFFFFFFFU
#define SDIO_SLC1_RXLINK_ADDR_S  0

/** SDIO_SLC_SLC1TX_LINK_REG register
 *  Sdio slave DMA channel1 configuration and status register of link list for slave
 *  receiving data.
 */
#define SDIO_SLC_SLC1TX_LINK_REG (DR_REG_SDIO_BASE + 0x54)
/** SDIO_SLC1_TXLINK_STOP : R/W/SC; bitpos: [28]; default: 0;
 *  Set 1 to stop the linked list operation for dma channel1 receiving packets.
 */
#define SDIO_SLC1_TXLINK_STOP    (BIT(28))
#define SDIO_SLC1_TXLINK_STOP_M  (SDIO_SLC1_TXLINK_STOP_V << SDIO_SLC1_TXLINK_STOP_S)
#define SDIO_SLC1_TXLINK_STOP_V  0x00000001U
#define SDIO_SLC1_TXLINK_STOP_S  28
/** SDIO_SLC1_TXLINK_START : R/W/SC; bitpos: [29]; default: 0;
 *  Set 1 to start the linked list operation for dma channel1 receiving packets.
 *  Sending will start from address indicated by SLC0_TXLINK_ADDR.
 */
#define SDIO_SLC1_TXLINK_START    (BIT(29))
#define SDIO_SLC1_TXLINK_START_M  (SDIO_SLC1_TXLINK_START_V << SDIO_SLC1_TXLINK_START_S)
#define SDIO_SLC1_TXLINK_START_V  0x00000001U
#define SDIO_SLC1_TXLINK_START_S  29
/** SDIO_SLC1_TXLINK_RESTART : R/W/SC; bitpos: [30]; default: 0;
 *  Set 1 to restart and continue the linked list operation for dma channel1 receiving
 *  packets.
 */
#define SDIO_SLC1_TXLINK_RESTART    (BIT(30))
#define SDIO_SLC1_TXLINK_RESTART_M  (SDIO_SLC1_TXLINK_RESTART_V << SDIO_SLC1_TXLINK_RESTART_S)
#define SDIO_SLC1_TXLINK_RESTART_V  0x00000001U
#define SDIO_SLC1_TXLINK_RESTART_S  30
/** SDIO_SLC1_TXLINK_PARK : RO; bitpos: [31]; default: 1;
 *  The status bit for receiving link list fsm of dma channel1 in idle state
 */
#define SDIO_SLC1_TXLINK_PARK    (BIT(31))
#define SDIO_SLC1_TXLINK_PARK_M  (SDIO_SLC1_TXLINK_PARK_V << SDIO_SLC1_TXLINK_PARK_S)
#define SDIO_SLC1_TXLINK_PARK_V  0x00000001U
#define SDIO_SLC1_TXLINK_PARK_S  31

/** SDIO_SLC_SLC1TX_LINK_ADDR_REG register
 *  Sdio slave DMA channel1 address of first descriptor of receiving linked list.
 */
#define SDIO_SLC_SLC1TX_LINK_ADDR_REG (DR_REG_SDIO_BASE + 0x58)
/** SDIO_SLC1_TXLINK_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  The initial address of dma channel1's receiving linked list.
 */
#define SDIO_SLC1_TXLINK_ADDR    0xFFFFFFFFU
#define SDIO_SLC1_TXLINK_ADDR_M  (SDIO_SLC1_TXLINK_ADDR_V << SDIO_SLC1_TXLINK_ADDR_S)
#define SDIO_SLC1_TXLINK_ADDR_V  0xFFFFFFFFU
#define SDIO_SLC1_TXLINK_ADDR_S  0

/** SDIO_SLC_SLCINTVEC_TOHOST_REG register
 *  Sdio slave DMA channel0 address of first descriptor of receiving linked list.
 */
#define SDIO_SLC_SLCINTVEC_TOHOST_REG (DR_REG_SDIO_BASE + 0x5c)
/** SDIO_SLC0_TOHOST_INTVEC : WT; bitpos: [7:0]; default: 0;
 *  The interrupt vector for slave to interrupt host through dma channel0.
 */
#define SDIO_SLC0_TOHOST_INTVEC    0x000000FFU
#define SDIO_SLC0_TOHOST_INTVEC_M  (SDIO_SLC0_TOHOST_INTVEC_V << SDIO_SLC0_TOHOST_INTVEC_S)
#define SDIO_SLC0_TOHOST_INTVEC_V  0x000000FFU
#define SDIO_SLC0_TOHOST_INTVEC_S  0
/** SDIO_SLC1_TOHOST_INTVEC : WT; bitpos: [23:16]; default: 0;
 *  The interrupt vector for slave to interrupt host through dma channel1.
 */
#define SDIO_SLC1_TOHOST_INTVEC    0x000000FFU
#define SDIO_SLC1_TOHOST_INTVEC_M  (SDIO_SLC1_TOHOST_INTVEC_V << SDIO_SLC1_TOHOST_INTVEC_S)
#define SDIO_SLC1_TOHOST_INTVEC_V  0x000000FFU
#define SDIO_SLC1_TOHOST_INTVEC_S  16

/** SDIO_SLC_SLC0TOKEN0_REG register
 *  Sdio slave DMA channel0 receiving buffer configuration and status register.
 */
#define SDIO_SLC_SLC0TOKEN0_REG (DR_REG_SDIO_BASE + 0x60)
/** SDIO_SLC0_TOKEN0_WDATA : WT; bitpos: [11:0]; default: 0;
 *  The number of available receiving buffers.
 */
#define SDIO_SLC0_TOKEN0_WDATA    0x00000FFFU
#define SDIO_SLC0_TOKEN0_WDATA_M  (SDIO_SLC0_TOKEN0_WDATA_V << SDIO_SLC0_TOKEN0_WDATA_S)
#define SDIO_SLC0_TOKEN0_WDATA_V  0x00000FFFU
#define SDIO_SLC0_TOKEN0_WDATA_S  0
/** SDIO_SLC0_TOKEN0_WR : WT; bitpos: [12]; default: 0;
 *  update slc0_token0_wdata into slc0 token0.
 */
#define SDIO_SLC0_TOKEN0_WR    (BIT(12))
#define SDIO_SLC0_TOKEN0_WR_M  (SDIO_SLC0_TOKEN0_WR_V << SDIO_SLC0_TOKEN0_WR_S)
#define SDIO_SLC0_TOKEN0_WR_V  0x00000001U
#define SDIO_SLC0_TOKEN0_WR_S  12
/** SDIO_SLC0_TOKEN0_INC : WT; bitpos: [13]; default: 0;
 *  Add 1 to slc0_token0.
 */
#define SDIO_SLC0_TOKEN0_INC    (BIT(13))
#define SDIO_SLC0_TOKEN0_INC_M  (SDIO_SLC0_TOKEN0_INC_V << SDIO_SLC0_TOKEN0_INC_S)
#define SDIO_SLC0_TOKEN0_INC_V  0x00000001U
#define SDIO_SLC0_TOKEN0_INC_S  13
/** SDIO_SLC0_TOKEN0_INC_MORE : WT; bitpos: [14]; default: 0;
 *  Set this bit to add the value of SDIO_SLC0TOKEN0_SLC0_TOKEN0_WDATA to
 *  SDIO_SLC0TOKEN0_SLC0_TOKEN0.
 */
#define SDIO_SLC0_TOKEN0_INC_MORE    (BIT(14))
#define SDIO_SLC0_TOKEN0_INC_MORE_M  (SDIO_SLC0_TOKEN0_INC_MORE_V << SDIO_SLC0_TOKEN0_INC_MORE_S)
#define SDIO_SLC0_TOKEN0_INC_MORE_V  0x00000001U
#define SDIO_SLC0_TOKEN0_INC_MORE_S  14
/** SDIO_SLC0_TOKEN0 : RO; bitpos: [27:16]; default: 0;
 *  The accumulated number of buffers for receiving packets through dma channel0.
 */
#define SDIO_SLC0_TOKEN0    0x00000FFFU
#define SDIO_SLC0_TOKEN0_M  (SDIO_SLC0_TOKEN0_V << SDIO_SLC0_TOKEN0_S)
#define SDIO_SLC0_TOKEN0_V  0x00000FFFU
#define SDIO_SLC0_TOKEN0_S  16

/** SDIO_SLC_SLC0TOKEN1_REG register
 *  Sdio slave DMA channel0 receiving buffer configuration and status register1.
 */
#define SDIO_SLC_SLC0TOKEN1_REG (DR_REG_SDIO_BASE + 0x64)
/** SDIO_SLC0_TOKEN1_WDATA : WT; bitpos: [11:0]; default: 0;
 *  The number of available receiving buffers.
 */
#define SDIO_SLC0_TOKEN1_WDATA    0x00000FFFU
#define SDIO_SLC0_TOKEN1_WDATA_M  (SDIO_SLC0_TOKEN1_WDATA_V << SDIO_SLC0_TOKEN1_WDATA_S)
#define SDIO_SLC0_TOKEN1_WDATA_V  0x00000FFFU
#define SDIO_SLC0_TOKEN1_WDATA_S  0
/** SDIO_SLC0_TOKEN1_WR : WT; bitpos: [12]; default: 0;
 *  update slc0_token1_wdata into slc0 token1
 */
#define SDIO_SLC0_TOKEN1_WR    (BIT(12))
#define SDIO_SLC0_TOKEN1_WR_M  (SDIO_SLC0_TOKEN1_WR_V << SDIO_SLC0_TOKEN1_WR_S)
#define SDIO_SLC0_TOKEN1_WR_V  0x00000001U
#define SDIO_SLC0_TOKEN1_WR_S  12
/** SDIO_SLC0_TOKEN1_INC : WT; bitpos: [13]; default: 0;
 *  slc0_token1 becomes to 1 when auto clear slc0_token1, else add 1 to slc0_token1
 */
#define SDIO_SLC0_TOKEN1_INC    (BIT(13))
#define SDIO_SLC0_TOKEN1_INC_M  (SDIO_SLC0_TOKEN1_INC_V << SDIO_SLC0_TOKEN1_INC_S)
#define SDIO_SLC0_TOKEN1_INC_V  0x00000001U
#define SDIO_SLC0_TOKEN1_INC_S  13
/** SDIO_SLC0_TOKEN1_INC_MORE : WT; bitpos: [14]; default: 0;
 *  Set this bit to add the value of SDIO_SLC0TOKEN1_SLC0_TOKEN1_WDATA to
 *  SDIO_SLC0TOKEN1_SLC0_TOKEN1.
 */
#define SDIO_SLC0_TOKEN1_INC_MORE    (BIT(14))
#define SDIO_SLC0_TOKEN1_INC_MORE_M  (SDIO_SLC0_TOKEN1_INC_MORE_V << SDIO_SLC0_TOKEN1_INC_MORE_S)
#define SDIO_SLC0_TOKEN1_INC_MORE_V  0x00000001U
#define SDIO_SLC0_TOKEN1_INC_MORE_S  14
/** SDIO_SLC0_TOKEN1 : RO; bitpos: [27:16]; default: 0;
 *  The accumulated number of buffers for receiving packets through dma channel0.
 */
#define SDIO_SLC0_TOKEN1    0x00000FFFU
#define SDIO_SLC0_TOKEN1_M  (SDIO_SLC0_TOKEN1_V << SDIO_SLC0_TOKEN1_S)
#define SDIO_SLC0_TOKEN1_V  0x00000FFFU
#define SDIO_SLC0_TOKEN1_S  16

/** SDIO_SLC_SLC1TOKEN0_REG register
 *  Sdio slave DMA channel1 receiving buffer configuration and status register.
 */
#define SDIO_SLC_SLC1TOKEN0_REG (DR_REG_SDIO_BASE + 0x68)
/** SDIO_SLC1_TOKEN0_WDATA : WT; bitpos: [11:0]; default: 0;
 *  The number of available receiving buffers.
 */
#define SDIO_SLC1_TOKEN0_WDATA    0x00000FFFU
#define SDIO_SLC1_TOKEN0_WDATA_M  (SDIO_SLC1_TOKEN0_WDATA_V << SDIO_SLC1_TOKEN0_WDATA_S)
#define SDIO_SLC1_TOKEN0_WDATA_V  0x00000FFFU
#define SDIO_SLC1_TOKEN0_WDATA_S  0
/** SDIO_SLC1_TOKEN0_WR : WT; bitpos: [12]; default: 0;
 *  update SLC1_token0_wdata into SLC1 token0.
 */
#define SDIO_SLC1_TOKEN0_WR    (BIT(12))
#define SDIO_SLC1_TOKEN0_WR_M  (SDIO_SLC1_TOKEN0_WR_V << SDIO_SLC1_TOKEN0_WR_S)
#define SDIO_SLC1_TOKEN0_WR_V  0x00000001U
#define SDIO_SLC1_TOKEN0_WR_S  12
/** SDIO_SLC1_TOKEN0_INC : WT; bitpos: [13]; default: 0;
 *  Add 1 to SLC1_token0.
 */
#define SDIO_SLC1_TOKEN0_INC    (BIT(13))
#define SDIO_SLC1_TOKEN0_INC_M  (SDIO_SLC1_TOKEN0_INC_V << SDIO_SLC1_TOKEN0_INC_S)
#define SDIO_SLC1_TOKEN0_INC_V  0x00000001U
#define SDIO_SLC1_TOKEN0_INC_S  13
/** SDIO_SLC1_TOKEN0_INC_MORE : WT; bitpos: [14]; default: 0;
 *  Set this bit to add the value of SDIO_SLC1TOKEN0_SLC1_TOKEN0_WDATA to
 *  SDIO_SLC1TOKEN0_SLC1_TOKEN0.
 */
#define SDIO_SLC1_TOKEN0_INC_MORE    (BIT(14))
#define SDIO_SLC1_TOKEN0_INC_MORE_M  (SDIO_SLC1_TOKEN0_INC_MORE_V << SDIO_SLC1_TOKEN0_INC_MORE_S)
#define SDIO_SLC1_TOKEN0_INC_MORE_V  0x00000001U
#define SDIO_SLC1_TOKEN0_INC_MORE_S  14
/** SDIO_SLC1_TOKEN0 : RO; bitpos: [27:16]; default: 0;
 *  The accumulated number of buffers for receiving packets through dma channel1.
 */
#define SDIO_SLC1_TOKEN0    0x00000FFFU
#define SDIO_SLC1_TOKEN0_M  (SDIO_SLC1_TOKEN0_V << SDIO_SLC1_TOKEN0_S)
#define SDIO_SLC1_TOKEN0_V  0x00000FFFU
#define SDIO_SLC1_TOKEN0_S  16

