espressif/esp-idf/components/soc/esp32c5/register/soc/sdio_slc_reg.h
/** SDIO_SLC_SLC0_LEN_CONF_REG register
 *  reserved
 */
#define SDIO_SLC_SLC0_LEN_CONF_REG (DR_REG_SDIO_BASE + 0xf4)
/** SDIO_SLC0_LEN_WDATA : WT; bitpos: [19:0]; default: 0;
 *  The packet length sent by dma channel0.
 */
#define SDIO_SLC0_LEN_WDATA    0x000FFFFFU
#define SDIO_SLC0_LEN_WDATA_M  (SDIO_SLC0_LEN_WDATA_V << SDIO_SLC0_LEN_WDATA_S)
#define SDIO_SLC0_LEN_WDATA_V  0x000FFFFFU
#define SDIO_SLC0_LEN_WDATA_S  0
/** SDIO_SLC0_LEN_WR : WT; bitpos: [20]; default: 0;
 *  Set this bit to set SLC0_LEN as SDIO_SLC0_LEN_WDATA.
 */
#define SDIO_SLC0_LEN_WR    (BIT(20))
#define SDIO_SLC0_LEN_WR_M  (SDIO_SLC0_LEN_WR_V << SDIO_SLC0_LEN_WR_S)
#define SDIO_SLC0_LEN_WR_V  0x00000001U
#define SDIO_SLC0_LEN_WR_S  20
/** SDIO_SLC0_LEN_INC : WT; bitpos: [21]; default: 0;
 *  Set this bit to add 1 to SLC0_LEN.
 */
#define SDIO_SLC0_LEN_INC    (BIT(21))
#define SDIO_SLC0_LEN_INC_M  (SDIO_SLC0_LEN_INC_V << SDIO_SLC0_LEN_INC_S)
#define SDIO_SLC0_LEN_INC_V  0x00000001U
#define SDIO_SLC0_LEN_INC_S  21
/** SDIO_SLC0_LEN_INC_MORE : WT; bitpos: [22]; default: 0;
 *  Set this bit to add the value of SDIO_SLC0_LEN_WDATA to SLC0_LEN.
 */
#define SDIO_SLC0_LEN_INC_MORE    (BIT(22))
#define SDIO_SLC0_LEN_INC_MORE_M  (SDIO_SLC0_LEN_INC_MORE_V << SDIO_SLC0_LEN_INC_MORE_S)
#define SDIO_SLC0_LEN_INC_MORE_V  0x00000001U
#define SDIO_SLC0_LEN_INC_MORE_S  22
/** SDIO_SLC0_RX_PACKET_LOAD_EN : WT; bitpos: [23]; default: 0;
 *  Write 1 to stitch new linked lists to current linked lists when dma channel0
 *  sending packets.
 */
#define SDIO_SLC0_RX_PACKET_LOAD_EN    (BIT(23))
#define SDIO_SLC0_RX_PACKET_LOAD_EN_M  (SDIO_SLC0_RX_PACKET_LOAD_EN_V << SDIO_SLC0_RX_PACKET_LOAD_EN_S)
#define SDIO_SLC0_RX_PACKET_LOAD_EN_V  0x00000001U
#define SDIO_SLC0_RX_PACKET_LOAD_EN_S  23
/** SDIO_SLC0_TX_PACKET_LOAD_EN : WT; bitpos: [24]; default: 0;
 *  Write 1 to stitch new linked lists to current linked lists when dma channel0
 *  receiving packets.
 */
#define SDIO_SLC0_TX_PACKET_LOAD_EN    (BIT(24))
#define SDIO_SLC0_TX_PACKET_LOAD_EN_M  (SDIO_SLC0_TX_PACKET_LOAD_EN_V << SDIO_SLC0_TX_PACKET_LOAD_EN_S)
#define SDIO_SLC0_TX_PACKET_LOAD_EN_V  0x00000001U
#define SDIO_SLC0_TX_PACKET_LOAD_EN_S  24
/** SDIO_SLC0_RX_GET_USED_DSCR : WT; bitpos: [25]; default: 0;
 *  Write 1 to get the current descriptor address when dma channel0 sending packets.
 */
#define SDIO_SLC0_RX_GET_USED_DSCR    (BIT(25))
#define SDIO_SLC0_RX_GET_USED_DSCR_M  (SDIO_SLC0_RX_GET_USED_DSCR_V << SDIO_SLC0_RX_GET_USED_DSCR_S)
#define SDIO_SLC0_RX_GET_USED_DSCR_V  0x00000001U
#define SDIO_SLC0_RX_GET_USED_DSCR_S  25
/** SDIO_SLC0_TX_GET_USED_DSCR : WT; bitpos: [26]; default: 0;
 *  Write 1 to get the current descriptor address when dma channel0 receiving packets.
 */
#define SDIO_SLC0_TX_GET_USED_DSCR    (BIT(26))
#define SDIO_SLC0_TX_GET_USED_DSCR_M  (SDIO_SLC0_TX_GET_USED_DSCR_V << SDIO_SLC0_TX_GET_USED_DSCR_S)
#define SDIO_SLC0_TX_GET_USED_DSCR_V  0x00000001U
#define SDIO_SLC0_TX_GET_USED_DSCR_S  26
/** SDIO_SLC0_RX_NEW_PKT_IND : RO; bitpos: [27]; default: 0;
 *  Represents a new packet is sent by dma channel0.
 */
#define SDIO_SLC0_RX_NEW_PKT_IND    (BIT(27))
#define SDIO_SLC0_RX_NEW_PKT_IND_M  (SDIO_SLC0_RX_NEW_PKT_IND_V << SDIO_SLC0_RX_NEW_PKT_IND_S)
#define SDIO_SLC0_RX_NEW_PKT_IND_V  0x00000001U
#define SDIO_SLC0_RX_NEW_PKT_IND_S  27
/** SDIO_SLC0_TX_NEW_PKT_IND : RO; bitpos: [28]; default: 1;
 *  Represents a new packet is received by dma channel0.
 */
#define SDIO_SLC0_TX_NEW_PKT_IND    (BIT(28))
#define SDIO_SLC0_TX_NEW_PKT_IND_M  (SDIO_SLC0_TX_NEW_PKT_IND_V << SDIO_SLC0_TX_NEW_PKT_IND_S)
#define SDIO_SLC0_TX_NEW_PKT_IND_V  0x00000001U
#define SDIO_SLC0_TX_NEW_PKT_IND_S  28
/** SDIO_SLC0_RX_PACKET_LOAD_EN_ST : R/WTC/SC; bitpos: [29]; default: 0;
 *  Represents whether the dma channel0 can be stitched to new linked lists when
 *  sending packets. 0- allowed, 1- not allowed.
 */
#define SDIO_SLC0_RX_PACKET_LOAD_EN_ST    (BIT(29))
#define SDIO_SLC0_RX_PACKET_LOAD_EN_ST_M  (SDIO_SLC0_RX_PACKET_LOAD_EN_ST_V << SDIO_SLC0_RX_PACKET_LOAD_EN_ST_S)
#define SDIO_SLC0_RX_PACKET_LOAD_EN_ST_V  0x00000001U
#define SDIO_SLC0_RX_PACKET_LOAD_EN_ST_S  29
/** SDIO_SLC0_TX_PACKET_LOAD_EN_ST : R/WTC/SC; bitpos: [30]; default: 0;
 *  Represents whether the dma channel0 can be stitched to new linked lists when
 *  receiving packets. 0- allowed, 1- not allowed.
 */
#define SDIO_SLC0_TX_PACKET_LOAD_EN_ST    (BIT(30))
#define SDIO_SLC0_TX_PACKET_LOAD_EN_ST_M  (SDIO_SLC0_TX_PACKET_LOAD_EN_ST_V << SDIO_SLC0_TX_PACKET_LOAD_EN_ST_S)
#define SDIO_SLC0_TX_PACKET_LOAD_EN_ST_V  0x00000001U
#define SDIO_SLC0_TX_PACKET_LOAD_EN_ST_S  30

/** SDIO_SLC_SLC0_LENGTH_REG register
 *  reserved
 */
#define SDIO_SLC_SLC0_LENGTH_REG (DR_REG_SDIO_BASE + 0xf8)
/** SDIO_SLC0_LEN : RO; bitpos: [19:0]; default: 0;
 *  Indicates the paclet length sent by the slave through dma channel0.
 */
#define SDIO_SLC0_LEN    0x000FFFFFU
#define SDIO_SLC0_LEN_M  (SDIO_SLC0_LEN_V << SDIO_SLC0_LEN_S)
#define SDIO_SLC0_LEN_V  0x000FFFFFU
#define SDIO_SLC0_LEN_S  0

/** SDIO_SLC_SLC0_TXPKT_H_DSCR_REG register
 *  Sdio slave DMA channel0 start address of receiving linked list register.
 */
#define SDIO_SLC_SLC0_TXPKT_H_DSCR_REG (DR_REG_SDIO_BASE + 0xfc)
/** SDIO_SLC0_TX_PKT_H_DSCR_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Configure the start address of receiving linked list to be stitched to the current
 *  linked list of dma channel0.
 */
#define SDIO_SLC0_TX_PKT_H_DSCR_ADDR    0xFFFFFFFFU
#define SDIO_SLC0_TX_PKT_H_DSCR_ADDR_M  (SDIO_SLC0_TX_PKT_H_DSCR_ADDR_V << SDIO_SLC0_TX_PKT_H_DSCR_ADDR_S)
#define SDIO_SLC0_TX_PKT_H_DSCR_ADDR_V  0xFFFFFFFFU
#define SDIO_SLC0_TX_PKT_H_DSCR_ADDR_S  0

/** SDIO_SLC_SLC0_TXPKT_E_DSCR_REG register
 *  Sdio slave DMA channel0 end address of receiving linked list register.
 */
#define SDIO_SLC_SLC0_TXPKT_E_DSCR_REG (DR_REG_SDIO_BASE + 0x100)
/** SDIO_SLC0_TX_PKT_E_DSCR_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Configure end address of receiving linked list to be stitched to the current linked
 *  list of dma channel0.
 */
#define SDIO_SLC0_TX_PKT_E_DSCR_ADDR    0xFFFFFFFFU
#define SDIO_SLC0_TX_PKT_E_DSCR_ADDR_M  (SDIO_SLC0_TX_PKT_E_DSCR_ADDR_V << SDIO_SLC0_TX_PKT_E_DSCR_ADDR_S)
#define SDIO_SLC0_TX_PKT_E_DSCR_ADDR_V  0xFFFFFFFFU
#define SDIO_SLC0_TX_PKT_E_DSCR_ADDR_S  0

/** SDIO_SLC_SLC0_RXPKT_H_DSCR_REG register
 *  Sdio slave DMA channel0 start address of sending linked list register.
 */
#define SDIO_SLC_SLC0_RXPKT_H_DSCR_REG (DR_REG_SDIO_BASE + 0x104)
/** SDIO_SLC0_RX_PKT_H_DSCR_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Configure the start address of sending linked list to be stitched to the current
 *  linked list of dma channel0.
 */
#define SDIO_SLC0_RX_PKT_H_DSCR_ADDR    0xFFFFFFFFU
#define SDIO_SLC0_RX_PKT_H_DSCR_ADDR_M  (SDIO_SLC0_RX_PKT_H_DSCR_ADDR_V << SDIO_SLC0_RX_PKT_H_DSCR_ADDR_S)
#define SDIO_SLC0_RX_PKT_H_DSCR_ADDR_V  0xFFFFFFFFU
#define SDIO_SLC0_RX_PKT_H_DSCR_ADDR_S  0

