espressif/esp-idf/components/soc/esp32c5/register/soc/sdio_slc_reg.h
/** SDIO_SLC_SLC1_TX_SHAREMEM_START_REG register
 *  Sdio slave DMA channel1 address range of receiving linked list register.
 */
#define SDIO_SLC_SLC1_TX_SHAREMEM_START_REG (DR_REG_SDIO_BASE + 0x164)
/** SDIO_SDIO_SLC1_TX_SHAREMEM_START_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  The start address boundary of descriptor can be used to receive packet through dma
 *  channel1.
 */
#define SDIO_SDIO_SLC1_TX_SHAREMEM_START_ADDR    0xFFFFFFFFU
#define SDIO_SDIO_SLC1_TX_SHAREMEM_START_ADDR_M  (SDIO_SDIO_SLC1_TX_SHAREMEM_START_ADDR_V << SDIO_SDIO_SLC1_TX_SHAREMEM_START_ADDR_S)
#define SDIO_SDIO_SLC1_TX_SHAREMEM_START_ADDR_V  0xFFFFFFFFU
#define SDIO_SDIO_SLC1_TX_SHAREMEM_START_ADDR_S  0

/** SDIO_SLC_SLC1_TX_SHAREMEM_END_REG register
 *  Sdio slave DMA channel1 address range of receiving linked list register1.
 */
#define SDIO_SLC_SLC1_TX_SHAREMEM_END_REG (DR_REG_SDIO_BASE + 0x168)
/** SDIO_SDIO_SLC1_TX_SHAREMEM_END_ADDR : R/W; bitpos: [31:0]; default: 4294967295;
 *  The end address boundary of descriptor can be used to receive packet through dma
 *  channel1.
 */
#define SDIO_SDIO_SLC1_TX_SHAREMEM_END_ADDR    0xFFFFFFFFU
#define SDIO_SDIO_SLC1_TX_SHAREMEM_END_ADDR_M  (SDIO_SDIO_SLC1_TX_SHAREMEM_END_ADDR_V << SDIO_SDIO_SLC1_TX_SHAREMEM_END_ADDR_S)
#define SDIO_SDIO_SLC1_TX_SHAREMEM_END_ADDR_V  0xFFFFFFFFU
#define SDIO_SDIO_SLC1_TX_SHAREMEM_END_ADDR_S  0

/** SDIO_SLC_SLC1_RX_SHAREMEM_START_REG register
 *  Sdio slave DMA channel1 address range of sending linked list register.
 */
#define SDIO_SLC_SLC1_RX_SHAREMEM_START_REG (DR_REG_SDIO_BASE + 0x16c)
/** SDIO_SDIO_SLC1_RX_SHAREMEM_START_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  The start address boundary of descriptor can be used to send packet through dma
 *  channel1.
 */
#define SDIO_SDIO_SLC1_RX_SHAREMEM_START_ADDR    0xFFFFFFFFU
#define SDIO_SDIO_SLC1_RX_SHAREMEM_START_ADDR_M  (SDIO_SDIO_SLC1_RX_SHAREMEM_START_ADDR_V << SDIO_SDIO_SLC1_RX_SHAREMEM_START_ADDR_S)
#define SDIO_SDIO_SLC1_RX_SHAREMEM_START_ADDR_V  0xFFFFFFFFU
#define SDIO_SDIO_SLC1_RX_SHAREMEM_START_ADDR_S  0

/** SDIO_SLC_SLC1_RX_SHAREMEM_END_REG register
 *  Sdio slave DMA channel1 address range of sending linked list register1.
 */
#define SDIO_SLC_SLC1_RX_SHAREMEM_END_REG (DR_REG_SDIO_BASE + 0x170)
/** SDIO_SDIO_SLC1_RX_SHAREMEM_END_ADDR : R/W; bitpos: [31:0]; default: 4294967295;
 *  The end address boundary of descriptor can be used to send packet through dma
 *  channel1.
 */
#define SDIO_SDIO_SLC1_RX_SHAREMEM_END_ADDR    0xFFFFFFFFU
#define SDIO_SDIO_SLC1_RX_SHAREMEM_END_ADDR_M  (SDIO_SDIO_SLC1_RX_SHAREMEM_END_ADDR_V << SDIO_SDIO_SLC1_RX_SHAREMEM_END_ADDR_S)
#define SDIO_SDIO_SLC1_RX_SHAREMEM_END_ADDR_V  0xFFFFFFFFU
#define SDIO_SDIO_SLC1_RX_SHAREMEM_END_ADDR_S  0

/** SDIO_SLC_HDA_TX_SHAREMEM_START_REG register
 *  Sdio slave HAD receiving address range register.
 */
#define SDIO_SLC_HDA_TX_SHAREMEM_START_REG (DR_REG_SDIO_BASE + 0x174)
/** SDIO_SDIO_HDA_TX_SHAREMEM_START_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Use 31 to 20 bit of this field as the higher 20 bits of 32-bit address for HAD
 *  receiving packets.
 */
#define SDIO_SDIO_HDA_TX_SHAREMEM_START_ADDR    0xFFFFFFFFU
#define SDIO_SDIO_HDA_TX_SHAREMEM_START_ADDR_M  (SDIO_SDIO_HDA_TX_SHAREMEM_START_ADDR_V << SDIO_SDIO_HDA_TX_SHAREMEM_START_ADDR_S)
#define SDIO_SDIO_HDA_TX_SHAREMEM_START_ADDR_V  0xFFFFFFFFU
#define SDIO_SDIO_HDA_TX_SHAREMEM_START_ADDR_S  0

/** SDIO_SLC_HDA_RX_SHAREMEM_START_REG register
 *  Sdio slave HAD sending address range register.
 */
#define SDIO_SLC_HDA_RX_SHAREMEM_START_REG (DR_REG_SDIO_BASE + 0x178)
/** SDIO_SDIO_HDA_RX_SHAREMEM_START_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Use 31 to 20 bit of this field as the higher 20 bits of 32-bit address for HAD
 *  sending packets.
 */
#define SDIO_SDIO_HDA_RX_SHAREMEM_START_ADDR    0xFFFFFFFFU
#define SDIO_SDIO_HDA_RX_SHAREMEM_START_ADDR_M  (SDIO_SDIO_HDA_RX_SHAREMEM_START_ADDR_V << SDIO_SDIO_HDA_RX_SHAREMEM_START_ADDR_S)
#define SDIO_SDIO_HDA_RX_SHAREMEM_START_ADDR_V  0xFFFFFFFFU
#define SDIO_SDIO_HDA_RX_SHAREMEM_START_ADDR_S  0

/** SDIO_SLC_BURST_LEN_REG register
 *  Sdio slave AHB burst type configuration register.
 */
#define SDIO_SLC_BURST_LEN_REG (DR_REG_SDIO_BASE + 0x17c)
/** SDIO_SLC0_TXDATA_BURST_LEN : R/W; bitpos: [0]; default: 1;
 *  AHB burst type: 0-incr4,1-incr8
 */
#define SDIO_SLC0_TXDATA_BURST_LEN    (BIT(0))
#define SDIO_SLC0_TXDATA_BURST_LEN_M  (SDIO_SLC0_TXDATA_BURST_LEN_V << SDIO_SLC0_TXDATA_BURST_LEN_S)
#define SDIO_SLC0_TXDATA_BURST_LEN_V  0x00000001U
#define SDIO_SLC0_TXDATA_BURST_LEN_S  0
/** SDIO_SLC0_RXDATA_BURST_LEN : R/W; bitpos: [1]; default: 1;
 *  AHB burst type: 0-incr4,1-incr8
 */
#define SDIO_SLC0_RXDATA_BURST_LEN    (BIT(1))
#define SDIO_SLC0_RXDATA_BURST_LEN_M  (SDIO_SLC0_RXDATA_BURST_LEN_V << SDIO_SLC0_RXDATA_BURST_LEN_S)
#define SDIO_SLC0_RXDATA_BURST_LEN_V  0x00000001U
#define SDIO_SLC0_RXDATA_BURST_LEN_S  1
/** SDIO_SLC1_TXDATA_BURST_LEN : R/W; bitpos: [2]; default: 1;
 *  AHB burst type: 0-incr4,1-incr8
 */
#define SDIO_SLC1_TXDATA_BURST_LEN    (BIT(2))
#define SDIO_SLC1_TXDATA_BURST_LEN_M  (SDIO_SLC1_TXDATA_BURST_LEN_V << SDIO_SLC1_TXDATA_BURST_LEN_S)
#define SDIO_SLC1_TXDATA_BURST_LEN_V  0x00000001U
#define SDIO_SLC1_TXDATA_BURST_LEN_S  2
/** SDIO_SLC1_RXDATA_BURST_LEN : R/W; bitpos: [3]; default: 1;
 *  AHB burst type: 0-incr4,1-incr8
 */
#define SDIO_SLC1_RXDATA_BURST_LEN    (BIT(3))
#define SDIO_SLC1_RXDATA_BURST_LEN_M  (SDIO_SLC1_RXDATA_BURST_LEN_V << SDIO_SLC1_RXDATA_BURST_LEN_S)
#define SDIO_SLC1_RXDATA_BURST_LEN_V  0x00000001U
#define SDIO_SLC1_RXDATA_BURST_LEN_S  3

/** SDIO_SLC_DATE_REG register
 *  Sdio slave DMA version register.
 */
#define SDIO_SLC_DATE_REG (DR_REG_SDIO_BASE + 0x1f8)
/** SDIO_SLC_DATE : R/W; bitpos: [31:0]; default: 554182400;
 *  Sdio slave DMA version register.
 */
#define SDIO_SLC_DATE    0xFFFFFFFFU
#define SDIO_SLC_DATE_M  (SDIO_SLC_DATE_V << SDIO_SLC_DATE_S)
#define SDIO_SLC_DATE_V  0xFFFFFFFFU
#define SDIO_SLC_DATE_S  0

/** SDIO_SLC_ID_REG register
 *  Sdio slave ID register.
 */
#define SDIO_SLC_ID_REG (DR_REG_SDIO_BASE + 0x1fc)
/** SDIO_SLC_ID : R/W; bitpos: [31:0]; default: 256;
 *  reserved
 */
#define SDIO_SLC_ID    0xFFFFFFFFU
#define SDIO_SLC_ID_M  (SDIO_SLC_ID_V << SDIO_SLC_ID_S)
#define SDIO_SLC_ID_V  0xFFFFFFFFU
#define SDIO_SLC_ID_S  0

#ifdef __cplusplus
}
#endif
